Repository: 84000/data-translation-memory
Catalog: toh440-v3.tmx
Source language: bo
Languages: en

source: དེ་ནས་སློབ་མ་སྡེ་ཚན་དང་པོའི་གཉིས་པ་ལ་དབྱངས་ཡིག་གསུམ་པས་བརྒྱན་པ། སྡེ་ཚན་བཞི་པའི་དང་པོ་ལ་དབྱངས་ཡིག་བཅུ་གསུམ་པས་བརྒྱན་པ་འབྱུང་སྟེ། ཟླ་བའི་མིང་དང་ལྡན་པ་རྫོགས་ནས་སོ། །
en: Then a disciple whose name is spelled with the second member of the first consonant class ornamented by the third vowel (khi) and the first member of the fourth consonant class ornamented with the thirteenth vowel (tau) and with the name Candra at the end will become king.

source: དེ་ནི་སྔོན་གྱི་དུས་སུ་རྗེ་བཙུན་འཇམ་དཔལ་གྱི་བཟླས་པ་བྱེ་བ་ཕྲག་བཅུ་གཉིས་བཟླས་པའི་འབྲས་བུའོ། །
en: That will be the result of his twelve million recitations of the honorable Mañjuśrī in a previous lifetime.

source: དེའི་ཕྱི་ནས་བྲམ་ཟེའི་མིང་ཅན་གྱི་རྒྱལ་པོ་འབྱུང་བར་འགྱུར་ཏེ།
en: “Varmāsana will be king after that, and then his son, grandson, and great-grandson will be yogins.

source: ཕྱི་ནས་དེའི་བུ་དང་བུའི་ཡང་བུ་ངེས་པར་རྣལ་འབྱོར་པར་འགྱུར་རོ། །ཡང་པཱ་ལ་ཞེས་པའི་མིང་དང་ལྡན་པར་གྱུར་ཏེ་སྐྱེས་བུ་གཅིག་ཁོ་ནའོ། །དེ་སྤངས་ནས་དཏྟ་དང་། གྷོ་ཥ་དང་། དྷ་མ་དང་།
en: Another with the name Pāla will follow, and he will have a single male heir.

source: སིང་ཧ་དང་། ནན་ཏི་དང་། ཨཾ་བ་ར་དང་། ཨཱ་དི་ཏྱ་དང་། སེ་ནཱ་རྣམས་ཀྱིས་རིམ་གྱིས་རིམ་གྱིས་སྐབས་སྐབས་སུ་སྐྱོང་བར་བྱེད་དོ། །
en: After he is gone, Datta, Ghoṣa, Dama, Siṃha, Nandi, Ambara, Āditya, and Senā will all rule in succession for a time.

source: ཕྱི་ནས་བསོད་ནམས་ཆུང་བར་གྱུར་པའི་རྒྱལ་པོ་འབྱུང་བར་འགྱུར་རོ། །
en: The kings that follow them will have little merit.

source: བ་ཊི་ཀེ་ར་ཀའི་བྱང་ཕྱོགས་སུ་རྒྱ་མཚོ་གཅིག་འབྱུང་སྟེ། ཕྱིས་བྱེ་མའི་ས་གཞིར་འགྱུར་རོ། །
en: “There will be a sea to the north of Paṭṭikeraka that will later become a desert.

source: ཡུལ་དེ་ལ་མ་ཌ་ཞེས་སོ། །དེར་ཀམ་པོ་ཛ་ཞེས་པའི་རྒྱལ་པོ་འབྱུང་བར་འགྱུར་རོ། །
en: In that country, there will be a place called Maḍa with a king named Kamboja.

source: དེའི་བུའི་མིང་ཀོ་ཤཱམྦ་ཞེས་པ་དང་ལྡན་པའི་རྒྱལ་པོ་འབྱུང་ཞིང་གྲོང་ཁྱེར་གྱི་མིང་ཡང་ཀོ་ཤཱམྦ་ཞེས་པ་འབྱུང་ངོ་། །
en: His son named Kośāmba will be king, and there will be a city named Kauśāmbi.

source: ཕྱི་ནས་ཡུལ་པ་ཏྲི་ཀ་རེ་ཀ་ར་ཤ་བྷ་ལ་ཞེས་པ་འབྱུང་སྟེ། དེའི་བུ་རྒྱལ་པོར་འགྱུར་རོ། །
en: Later in Paṭṭikeraka there will be one named Sārabhū, and his son will become king.

source: ཡང་བི་ཀྲ་མ་པཱུ་རི་ཞེས་པ་ཡུལ་གྱི་དབུས་སུ་བརྟགས་པ་དེར་འོན་ཀྱང་རྣལ་འབྱོར་མ་དངོས་གྲུབ་དང་ལྡན་པ་འབྱུང་སྟེ།
en: In the middle of that country is a place called Vikramapūri, where yoginīs will come and attain siddhi.

source: དེའི་དབུས་སུ་རྣལ་འབྱོར་མ་གཅིག་གིས་བཙུན་མོ་བྱེད་པར་འགྱུར་རོ། །དེའི་བསོད་ནམས་ཀྱིས་བུའི་བུ་ལ་སོགས་པའི་རིགས་བརྒྱུད་ཀྱི་བྷཾ་ག་ལ་དག་པར་བྱ་སྟེ།
en: A yoginī will serve as queen over the middle of that country, and due to her merit, the lineage of her son, grandson, and so forth will purify Baṅgala.

source: འོན་ཀྱང་འདིར་ས་གཞིའི་བཟོད་པ་ཟད་པ་ལ་རྩོད་པའི་དུས་ཞེས་བརྗོད་དོ། །
en: “It is said that when the earth there is depleted it will be the Kaliyuga.

source: དེ་རྫོགས་ནས་མགོན་པོ་བྱམས་པ་ཞེས་པའི་སངས་རྒྱས་འབྱུང་སྟེ། དངོས་པོ་མེད་པའི་རང་བཞིན་མཐོང་བ་བློ་གྲོས་ཀྱིས་འཆད་པར་འགྱུར་རོ། །
en: Once it passes, the buddha known as Lord Maitreya will appear and teach by means of his intellect, which sees the inherent nature that is non-existent.

source: གཞན་ཡང་ཡུལ་ཨོ་རུ་བྷི་ས་དང་། ཙོ་དྷ་དང་། སིངྒ་ལ་དྭཱི་པ་རྣམས་སུ་དུས་དུས་སུ་ཀླུའི་རྒྱལ་པོས་ཆར་འབེབས་པར་འགྱུར་རོ། །
en: The nāga kings will bring timely rains to the lands of Oḍra, Coḍa, and Siṁhaladvīpa.

source: ཡང་ཡུལ་ར་དྷ་རུ་པ་ལ་ཞེས་པའི་མིང་ཅན་སྐྱེས་བུ་སུམ་ཅུའི་བར་དུ་འབྱུང་སྟེ།
en: In the land of Radhā a line of men named Pāla will continue for thirty generations.

source: བརྒྱུད་པ་ཐ་མའི་བུས་ཡུལ་ཨོ་རུ་བྷི་སའི་རྒྱལ་པོ་འབྲས་བུ་ལ་ཕན་པ་ཞེས་པའི་ལྷ་སྐོར་དང་བཅས་པ་འཇོམས་ཤིང་།
en: The last descendant of that dynasty will conquer Saphala, the king of Oḍra, along with his divine retinue, and conquer the yoginīs.

source: རྣལ་འབྱོར་མ་རྣམས་འཇོམས་པ་འབྱུང་སྟེ། དེས་རྣལ་འབྱོར་པ་རྣམས་ཀྱི་གཙོ་བོ་མཆོག་གི་དབང་ཕྱུག་ཐོབ་པ་ནི་སངས་རྒྱས་དང་མཉམ་པར་སྡོམ་པ་དང་ལྡན་པས་བཟླས་པ་བྱེ་བ་ཕྲག་བཅུ་གཉིས་བཟླས་པས་སོ། །
en: He will then attain the state of a preeminent yogin, a lord of yoga whose vow equals that of the buddhas, and he will perform twelve million mantra recitations.

source: དེའི་སློབ་མ་གཉིས་དང་། སློབ་མའི་སློབ་མ་གསུམ་དང་།
en: He will have two disciples, and his two disciples will have three disciples, and those three will also have yogin disciples.

source: དེའི་ཡང་སློབ་མ་རྣལ་འབྱོར་པ་རྣམས་དང་། པཎྜི་ཏ་རྣམས་ཀྱི་གཙོ་བོར་གྱུར་པ་ཆོས་ཀྱི་གྲགས་པ་ཞེས་པར་ཡོངས་སུ་གྲགས་པ་འདི་དང་སྐྱེས་བུ་དྲུག་བསྟན་པ་ལ་ཕན་པ་ཚངས་པར་སྤྱོད་པ་ལ་གནས་པ་རྣམས་ཀྱིས་གྲུབ་པ་འཐོབ་བོ། །
en: They will have a disciple, the renowned Dharmakīrti, who is preeminent among yogins and scholars. He and six other people who benefit the teachings and have adopted the spiritual life will attain siddhi.

source: ཕྱི་ནས་མ་ཏི་ལ་དང་། པཱ་ག་ར་དང་། བྷ་བྱ་གྷོ་ཥ་དང་། ས་ཧཱ་སྲི་ཀཱརྞ་ཞེས་པའི་མིང་ཅན་ཡོངས་སུ་སྐྱོང་བ་རྣམས་ལོ་བཅུ་གསུམ་གྱིས་གྲུབ་པ་ཐོབ་པ་འབྱུང་ངོ་། །
en: “Later, protectors named Matila, Pāgara, Bhavyaghoṣa, and Sahāsrakārṇa will attain siddhi over the course of thirty years.

source: ཡང་རྣལ་འབྱོར་པས་སརྨ་དང་། ཧ་ཏི་ན་དང་། གརྨུ་ཀ་དང་། པ་ཙན་ན་དང་། སམ་བེ་དུ་དང་།
en: The Kūrma lineage will conclude with the yogins Sarma, Hastin, Garmuka, Pacana, Samveda, Buddhahāsa, and Patela.

source: བུད་དྷ་ཧ་ས་དང་། པ་ཏེ་ལ་རྣམས་ཀྱིས་རུས་སྦལ་གྱི་རིགས་རྫོགས་སོ། །དེའི་ནུབ་ཕྱོགས་སུ་གྲོང་ཁྱེར་མཱ་ལ་ལཱི་ཞེས་པ་གྲུབ་པ་ཐོབ་པའི་གནས་དེར་བྷོ་ཛྱ་དེ་བ་ཞེས་པར་ཡོངས་སུ་གྲགས་པར་རྫོགས་ནས།
en: “Farther west will be a city named Mālavī, a place where siddhi is attained.

source: ཀོ་ཏི་ཀ་དང་པཱ་ལི་ཏ་དག་འཁོར་དང་བཅས་པ་ཡིས་ཚེ་ལོ་སྟོང་ཕྲག་གཅིག་ཐུབ་པའི་རྒྱལ་པོ་འབྱུང་ངོ་། །
en: After the time of the renowned Bhojyadeva, two sage-kings named Khotika and Pālita and their courts will rule there for one thousand years.

source: དེའི་ནུབ་ཕྱོགས་སུ་གྲོང་ཁྱེར་སམ་བུ་ཀ་ཞེས་བྱ་བ་འབྱུང་སྟེ་དེར་རྒྱལ་པོ་སྟོང་ཕྲག་ལྔ་རུ་བྷ་དྷ་ན་ཞེས་པ་དང་ལྡན་པའི་མིང་ཅན་འབྱུང་ངོ་། །ཕྱི་ནས་ཀ་ལེ་དང་མ་ལ་ཞེས་པ་འབྱུང་སྟེ། དེ་དག་གིས་གྲུབ་པ་ཐོབ་པར་འགྱུར་རོ། །
en: “West of that city there will be a city called Sambuka, where a line of kings named Govardhana will rule for five thousand years, followed by Kale and Mala, both of whom will attain siddhi.

source: དེའི་ལྷོ་ཕྱོགས་སུ་གྲོང་ཁྱེར་ཨ་ཛ་ར་ཡོ་གི་ནཱི་ཞེས་པ་འབྱུང་སྟེ། དེར་ཀླུ་སྒྲུབ་པ་ཞེས་བྱ་བའི་རྣལ་འབྱོར་པས་ཤིང་ས་ལ་ཞོན་པ་གོ་པཱ་ལ་ཞེས་པ་ལ་རྒྱལ་པོ་བྱིན་པས་བུ་ཤི་ནས་བ་ཧྣའི་ཚ་བོ་ལ་སོགས་པའི་རྒྱལ་པོ་འབྱུང་ངོ་། །
en: “To its south will be a city called Ajarayoginī, where the yogin named Nāgārjuna will give his kingdom to Gopāla, who will have climbed a sala tree.

source: དཔལ་རྣལ་འབྱོར་གྱི་དབང་ཕྱུག་རྫོགས་ནས་འཇིག་རྟེན་གསུམ་གྱི་རྒྱལ་པོའི་འབྲེལ་པ་དངོས་གྲུབ་ཆེན་པོ་བརྒྱད་ཀྱི་རྙེད་པ་ཐོབ་པ་འབྱུང་སྟེ།
en: After his son dies, that line of kings will proceed from Vahna’s grandson, who will reach perfection as a glorious lord of yoga and attain the eight great siddhis associated with being king of the threefold world.

source: དེའི་མིང་ནི་ཀེ་བ་ཏ་པུ་ཏྲ་ཞེས་པའི་རྒྱལ་པོའི་བུ་རྗེ་རིགས་ཀྱིས་བསད་ནས་དེའི་བུ་དང་བུའི་ཡང་བུའི་བར་དུ་ནུབ་ཕྱོགས་སུ་གང་དང་གང་སོང་བ་དེ་དང་དེ་རྡོ་རྗེར་གཤེགས་སོ། །
en: That king’s son, Kaivartaputra, will be killed by a member of the merchant caste, and those among his sons and grandsons who travel west will reach Vajra.

source: དེའི་ཡང་ནུབ་ཕྱོགས་ན་ཏྲི་པ་ཊ་ན་ཞེས་པའི་ལྷ་རྟེན་ཡོད་པས་སོ། །
en: “Even farther west is a temple called Tripāṭana, to the south of which one of his sons, named Ārka, will reside.

source: དེའི་ལྷོ་ཕྱོགས་སུ་དེའི་བུ་ཉི་མ་ཞེས་པ་འབྱུང་ངོ་། །དེའི་ལྷོ་ནུབ་མཚམས་སུ་གྲོང་ཁྱེར་བྷ་ཊ་ཀུ་ནི་རེ་ཞེས་པར་གྲོང་ཁྱེར་བ་རྣམས་བློ་གྲོས་དང་ལྡན་པ་འབྱུང་ཞིང་རྒྱལ་པོ་ནི་བྷན་དུ་དེ་ཝ་ཞེས་པ་འབྱུང་ངོ་། །
en: At its southwestern border is a city named Bhaṭakunire, where the intelligent citizens are ruled by a king named Bandhadeva.

source: དེའི་བུ་དང་བུའི་ཡང་བུ་རྫོགས་ནས་སིན་དྷུ་ཞེས་པར་གྱུར་ནས་འགྲོའོ། །དེ་ཤི་ན་གར་ཞེས་པར་འབྱུང་ངོ་། །
en: Following his sons and grandsons, the next in line will move to Sindhu, and upon his death the line will appear in a place named Gar.

source: ཕྱི་ནས་སྐྱེ་བ་བདུན་གྱི་བར་དུ་རྣལ་འབྱོར་པར་འབྱུང་བར་ཤེས་པར་བྱས་ཏེ་ཕྱོགས་དང་ཕྱོགས་བྲལ་བ་རྣམས་ཀྱང་ངོ་། །
en: For the next seven generations they will be recognized yogins and will not be associated with any country.

source: དེ་ནས་གྲོང་ཁྱེར་དེ་ལ་བྷན་དྷ་ནི་ཞེས་པར་འགྱུར་ནས་འགྲོའོ། །དེ་རུ་ཙཎྜ་མ་ཧཱ་རོ་ཥ་ཎའི་རྣལ་འབྱོར་ཉམས་སུ་བླངས་པས་རྒྱལ་པོར་འགྱུར་རོ། །
en: After that, the next in line will leave that city for a place named Bhandani, where he will unite with Caṇḍa­mahāroṣaṇa and become king.

source: དེ་ཡིས་སྐྱེ་བ་འདི་ལ་སངས་རྒྱས་ཀྱི་འབྲས་བུ་འཁོར་དང་བཅས་པ་ཡིས་འཐོབ་བོ། །
en: He and his entire court will attain the fruit of buddhahood in that lifetime.

source: ལྷོ་ཕྱོགས་ན་གྲོང་ཁྱེར་ས་བྷིཉྫི་ཀ་ཞེས་པ་སངས་རྒྱས་ཀྱིས་དུས་ཐམས་ཅད་དུ་བྱིན་གྱིས་བརླབས་པའི་གནས་སུ་སངས་རྒྱས་རྗེ་བཙུན་གྱིས་རྒྱལ་པོ་མཛད་པ་ལ་འཁོར་གྲུབ་ཐོབ་རྣམས་ཀྱིས་བསྐོར་བ་འབྱུང་སྟེ་ལོ་སྟོང་གི་བར་དུའོ། །
en: “To the south there is a town called Sarṣibhañjikā, where the blessing of the buddhas is always present. A venerable buddha will rule there for one thousand years, surrounded by a court of people who have all attained siddhi.

source: དེའི་བྱང་ཕྱོགས་སུ་ལྷས་མཛད་པའི་རྡོ་རྗེའི་ཁྲི་ལ་བཞུགས་པའི་རྗེ་བཙུན་བཞུགས་སོ། །དེའི་ཤར་ཕྱོགས་མཚམས་སུ་ཡུལ་ཁརྶ་པཱ་ཎི་ཞེས་པར་རྗེ་བཙུན་འཕགས་པ་སྤྱན་རས་གཟིགས་ངེས་པར་འབྱུང་བར་འགྱུར་རོ། །
en: The lord who sits upon the vajra throne fashioned by the gods will live to the north, and the venerable noble Avalokiteśvara will appear in the land named Khasarpāṇi along the eastern frontier.

source: ནུབ་ཕྱོགས་སུ་གྲོང་ཁྱེར་མ་ཧཱ་བྷཉྫ་པུ་རི་ཞེས་པ་འབྱུང་ངོ་། །དེར་རྒྱལ་པོ་བ་སུ་བྷ་དྷ་ན་ཞེས་པ་འབྱུང་སྟེ།
en: “In the west there will be a city called Mahābhañjapuri, where a king named Vasubhadhana will rule.

source: དེའི་བུ་དང་བུའི་ཡང་བུ་རྫོགས་ནས་རྒྱལ་པོ་གདུང་བརྒྱུད་འཆད་དོ། །དེ་ནས་ཐམས་ཅད་རྒྱ་མཚོས་ནུབ་པར་འགྱུར་རོ། །
en: It is said that the line of his descendants will last for eight generations, and then the entire town will fall into the sea.

source: གཞན་ཡང་ཡུལ་ལཊ་དང་ཙོ་ཌ་དང་། གོ་དྷ་བང་ག་ལ་དང་པོ་ཨོ་ཌི་ཡཱ་ན་དང་། ཛ་ལནྡྷ་ར་དང་། པ་ཊི་ཀེ་ར་ཀ་དང་། ཀཱ་མ་རཱུ་པ་ལ་སོགས་པ་རྣམ་པ་རྒྱུན་དུ་སངས་རྒྱས་ཀྱིས་བྱིན་གྱིས་བརླབས་མཛད་པར་འགྱུར་རོ། །
en: “Countries such as Lāṭa, Coḍa, Gauḍa, Baṅgala, Oḍiyāna, Jālandhara, Paṭṭikeraka, Kāmarūpa, and so forth will be continually blessed by the buddhas.

source: ཡུལ་དེ་རྣམས་སུ་འདོད་པ་ཐམས་ཅད་འབྱུང་སྟེ། རྒྱལ་པོ་དང་། འཁོར་དང་། རྣལ་འབྱོར་པ་དང་། གྲུབ་པ་ཐོབ་པ་ལ་སོགས་པ་དོན་རྣམས་ཡོངས་སུ་མཛད་པ་ལ་འཛམ་བུའི་གླིང་ཞེས་གྲགས་སོ། །
en: In these lands, renowned as Jambudvīpa, every desire will be available, and the kings, royal courts, yogins, siddhas, and the like will fulfill their aims.

source: རྒྱ་མཚོའི་ཤར་ཕྱོགས་སུ་རི་བོ་ཧུ་ར་ཞེས་པ་ན། ལྷ་མ་ཡིན་དཔག་ཏུ་མེད་པ་གནས་པ་འབྱུང་ངོ་། །
en: “To the east of the ocean is the mountain Hura, which is home to an unfathomable number of asuras.

source: ལྷོ་ཕྱོགས་སུ་བྱ་རོག་གི་གདོང་པ་ཅན་ཞེས་པ་གནས་པར་འགྱུར་ཏེ། དེ་དག་ཐམས་ཅད་ཀྱིས་ཀྱང་ཐབས་མཆོག་ཏུ་གྱུར་པ་ཤེས་པ་འབྱུང་ངོ་། །
en: To the south is the home of the crow-faced people, who are all known to be eminently skillful.

source: རྒྱ་མཚོའི་ལྷོ་ཕྱོགས་སུ་མི་གདོང་གྲུ་གསུམ་པ་དང་། སྲིན་པོ་དང་། མིའམ་ཅི་དང་། ལྷ་མ་ཡིན་ལ་སོགས་པ་རྣམས་དང་། སྤྲེའུ་ལ་སོགས་པ་རྣམས་ཧ་ཧ་ཞེས་པའི་སྒྲ་སྒྲོགས་པ་དང་། ཧ་ནུ་མན་ཏ་རྣམས་ངེས་པར་གནས་པར་འབྱུང་བར་འགྱུར་རོ། །
en: To the south of the ocean live the triangular-faced people, rākṣasas, kinnaras, asuras, and the like, monkeys and other animals whose cries sound like laughter, and Hanumān.

source: རྒྱ་མཚོའི་ནུབ་ཕྱོགས་སུ་ཟླ་བ་ཕྱེད་པའི་གདོང་པ་ཅན་གྱི་མི་གནས་པར་འགྱུར་རོ། །དེའི་ནུབ་ཕྱོགས་ན་ལྷ་ལ་སོགས་པ་གནས་པ་འབྱུང་ངོ་། །
en: To the west of the ocean live people with faces shaped like half-moons, and to the west of them live the gods and the like.

source: རྒྱ་མཚོས་བསྐོར་བ་ན་གནས་པའི་མི་རྣམས་ལ་བ་ལང་སྤྱོད་ཅེས་བསྒྲགས་ཏེ།
en: “The home of the people who live around the ocean is called Godānīya.

source: དེ་ན་གནས་པའི་མི་རྣམས་གདོང་ཟླུམ་པོ་དང་ལྡན་པ་དང་། དེ་རྣམས་ཀྱི་རྒྱལ་པོར་གནས་པ་དེ་ཡུལ་ཐམས་ཅད་ཀྱི་རྒྱལ་པོ་སྟེ།
en: The people there have circular faces, and the king who lives there rules over the entire region.

source: འཆི་འཕོ་བ་དང་སྐྱེ་བ་མེད་པར་འབྱུང་བར་འགྱུར་རོ། །
en: He is not subject to the process of death, transmigration, and rebirth.

source: དེའི་ནུབ་ཕྱོགས་ཀྱི་གྲོང་ཁྱེར་ར་ས་ལན་དྷི་ཞེས་པར་དང་པོའི་དུས་སུ་ལྷ་མ་ཡིན་གྱི་རྒྱལ་པོ་འབྱུང་ངོ་། །
en: “To the west is a city called Rasalandhi, where an asura king will reign during its initial period.

source: དེ་ནས་རྒྱལ་པོ་ལྷའི་ལུས་ཅན་ཞེས་བྱ་བའི་མིང་གི་རྒྱལ་པོ་འབྱུང་ངོ་། །དེ་བསད་ནས་ཀཾ་བི་སི་ཧ་ཞེས་པ་དང་བུ་དང་བུའི་ཡང་བར་དུ་འབྱུང་ངོ་། །
en: He will be followed by a king named Devāṅgana, and when he dies he will be followed by his son Kāmpisiṃha and by his grandson.

source: དེ་ནས་བྷེ་ས་ཛྱ་སེ་ན་ཞེས་པའི་མིང་གི་མཐའ་རྟེན་དང་ལྡན་པའི་སྐྱེས་བུ་བདུན་གྱི་བར་དུ་འབྱུང་ངོ་། །དེ་ནས་པ་ལ་ཞེས་པའི་རྒྱལ་པོ་འབྱུང་སྟེ།
en: After that, seven generations of men with the surname Bhaiṣajyasena will rule, followed by a king named Pāla.

source: དེ་ནས་དེས་ཉ་པའི་ཤུ་བི་ལ་གྲོང་འཇུག་བྱས་པས་རྒྱལ་པོ་ས་ཧ་དེ་ཝ་ཞེས་པར་འགྱུར་བ་འབྱུང་ངོ་། །
en: After that, a king called Sahadevakaivartaputra will enter the town to the west.

source: གྲོང་ཁྱེར་གསེར་གླིང་གི་ཤར་ཕྱོགས་སུ་གྲོང་ཁྱེར་མཎྜ་ཀ་ཞེས་པ་ན་རྒྱུན་དུ་གནས་པའི་མི། རྨ་བྱའི་མདོངས་ལ་བརྒྱན་པ་ཞལ་རྒྱས་པ།
en: “There is a city named Maṇḍa to the east of Kāñcana, where the original inhabitants were people with broad faces adorned with peacock feathers.

source: ཨོཾ་སུ་མུ་ཁི་ནི་སརྦ་ཞེས་པའི་སྔགས་བརྗོད་ནས་ཟས་སུ་ལྦུ་བ་ཟ་བ་དེ་རྣམས་ཀྱི་ལྷག་མ་མེད་པར་བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་ཚོགས་ཐོབ་བོ། །
en: They completed the accumulation of merit and wisdom by reciting the mantra oṁ sumukhinī sarva and consuming only saliva as food.

source: དེའི་རྒྱལ་པོ་སྦྲུལ་གྱིས་ཕྱོགས་བཞིའི་རྒྱན་བྱེད་པ་འབྱུང་ངོ་། །དེ་ནས་སྲིན་པོར་འགྱུར་ཏེ།
en: Their king will be the serpent who beautifies the four directions, and a rākṣasa will rule after him.

source: དེའི་བུ་དང་བུའི་ཡང་བུའི་བར་རྫོགས་ནས་རྒྱ་མཚོ་ཡིས་ཐམས་ཅད་ནུབ་པར་འགྱུར་རོ། །
en: After the line of his sons and grandsons comes to an end, everything will fall into the sea.”

source: ལྷ་མོས་གསོལ་པ། ཀྱེ་བཅོམ་ལྡན་འདས་ཅིའི་ཕྱིར་གནས་ཐམས་ཅད་རྫོགས་པར་མི་གསུང་ཐམས་ཅད་དུ་ཡོངས་སུ་གསུངས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་པ་སྤངས་ནས་གསུངས་པ་ཅིའི་ཕྱིར།
en: The Goddess asked, “Blessed One, why have you not described all the places there are? And in those you did describe, why did you leave out the bodhisattvas associated with them?

source: དེའི་ཕྱིར་འདི་སྐད་ལ་སོགས་པ་མི་བདེན་ནོ། །
en: Is there anything about what you have said that is false?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ལྷ་མོ་ཆེན་མོ་ཉོན་ཅིག་ཉོན་ཅིག །
en: “Listen closely, Great Goddess,” the Blessed One replied.

source: གང་དང་གང་དུ་ང་ཡིས་གནས་བསྟན་པ། དེ་དང་དེ་ནི་སངས་རྒྱས་ཀྱིས་བྱིན་གྱིས་བརླབས་པའོ། །
en: “Each of the places I described has been blessed by buddhas.

source: གནས་གཞན་རྣམས་ནི་སངས་རྒྱས་མ་ཡིན་པའི་ལྷ་རྣམས་ཀྱིས་རྣམ་པར་བརྟགས་པའོ། །གང་གྲུབ་པ་ཐོབ་པ་ཐམས་ཅད་ཀྱི་མིང་གནས་ཀྱིས་བརྟགས་སོ། །
en: There are other places that have been created by deities who are not buddhas, and all such places have been named after someone who has attained siddhis.

source: སྡིག་པ་རེ་རེ་དག་པར་བྱེད་པ་གང་དང་གང་ལ་ཡོད་པ་དེ་དང་དེ་ཏིང་ངེ་འཛིན་ནོ། །
en: A samādhi exists in each of these places that brings about the purification of every wicked deed.

source: བུམ་པ་གསུམ་ལ་སོགས་པ་རྣམས་དང་། གང་དང་གང་ལ་ཕུང་པོ་ལྔ་རྣམས་ཡོད་པ་ལ་ལུས་ཞེས་བྱ་སྟེ།
en: There are places where the three vases and the like are known to be the body wherein the five aggregates are present.

source: རྒྱལ་པོ་དང་རྒྱལ་སྲིད་རྣམས་དང་། རྣལ་འབྱོར་པ་དང་། རྣལ་འབྱོར་མ་རྣམས་ལ་དབུགས་དབྱུང་བ་དང་། དབུགས་འཇུག་པས་དག་པ་ནི་དཔེར་ན་དབང་པོ་དང་ཡུལ་བཞིན་ནོ། །
en: Kings, kingdoms, yogins, and yoginīs are purified with each exhalation and inhalation, as exemplified by the sense faculties and sense objects.

source: བདེ་བར་གཤེགས་པའི་ལམ་དང་འབྲེལ་པ་ལ་སྐྱབས་སུ་གང་འགྲོ་བ་དེས་སྐྱེ་བ་འདི་ལ་བསྒྲུབ་པར་བྱས་པ་ཐམས་ཅད་འགྲུབ་བོ། །གང་གིས་རྒྱལ་པོའི་གཏམ་རྒྱུད་འདི་བཀླགས་ན་དེས་ལྐོག་ཏུ་གྱུར་པའི་ཡེ་ཤེས་འཐོབ་བོ། །
en: “Any being who goes for refuge in those connected with the path of the sugatas will accomplish everything they have set out to accomplish in this lifetime, and anyone who recites this account of royal lineages will receive its hidden wisdom.

source: ལེའུ་སུམ་ཅུ་སོ་དྲུག་པར་རྩིས་ཀྱི་ཡེ་ཤེས་བརྗོད་པར་བྱ་སྟེ། འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བ་ཇི་ལྟར་ཤེས་པ་དེའི་བྱ་བ་བྱེད་དོ། །
en: “In chapter thirty-six I will explain the wisdom of calculation, which will correctly engage the knowledge of the past, future, and present.

source: ཀྱེ་ལྷ་མོ་ལེའུ་ཉི་ཤུ་རྩ་ལྔ་པ་ལ་སོགས་པར་མིང་གང་གིས་ཐམས་ཅད་ཤེས་པར་བྱེད་པར་ནུས་པ་དེའི་དུས་ཀྱི་ཡེ་ཤེས་སོ། །
en: In chapter twenty-five and elsewhere, Goddess, I will explain the names that have the capacity to engender omniscience, and I will explain the wisdom that arises on that occasion.

source: དེ་ལྟར་ཐམས་ཅད་བདུད་ཀྱིས་བསླུས་པར་མི་འགྱུར་རོ། །
en: In this way, no one will ever be deceived by Māra.”

source: འདི་ནི་ནག་པོ་ཆེན་པོའི་རྒྱུད་ཀྱི་རྒྱལ་པོ་ལས་རྒྱལ་པོའི་གཏམ་རྒྱུད་བསྟན་པའི་ལེའུ་སྟེ་བཅོ་ལྔ་པའོ།། །།དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: This concludes chapter fifteen in The Sovereign Tantra of Mahākāla, “An Account of Royal Lineages.”

source: བསྒྲུབ་པར་བྱ་བ་རྒྱལ་པོ་འདོད་པས་རྒྱལ་པོ་ལ་བལྟ་བར་བྱའོ། །བསྒྲུབ་པར་བྱ་བ་དངུལ་ཆུ་འདོད་པས་དངུལ་ཆུ་ལ་བལྟ་བར་བྱའོ། །བསྒྲུབ་པར་བྱ་བ་ལུས་གྲུབ་པར་འདོད་པས་ལུས་ལ་བལྟ་བར་བྱའོ། །བསྒྲུབ་པར་བྱ་བ་དེ་ཁོ་ན་འདོད་པས་དེ་ཁོ་ན་ལ་བལྟ་བར་བྱའོ། །བསྒྲུབ་པར་བྱ་བ་འདོད་པའི་ཡོན་ཏན་འདོད་པས་འདོད་པའི་ཡོན་ཏན་ལ་བལྟ་བར་བྱའོ། །
en: Chapter 16: Sādhanas for Acquiring a Servant The Blessed One continued, “If someone is interested in attaining kingship, they should focus on kingship; if someone is interested in attaining the mercury siddhi, they should focus on the mercury siddhi; if someone is interested in attaining the corporeal siddhi, they should focus on the corporeal siddhi; if someone is interested in attaining ultimate reality, they should focus on ultimate reality; and if someone is interested in attaining the sense objects, they should focus on the sense objects.

source: ལྷ་མོ་དེའི་ཕྱིར་བསྒྲུབ་བྱ་གཅིག་གྲུབ་ནས་ཐམས་ཅད་ཚེགས་མེད་པར་འགྲུབ་བོ། །དེ་སྤངས་པའི་གཞན་སྒྲུབ་པ་རྣམས་འབྲས་བུ་མེད་པ་ལ་འབད་རྩོལ་བྱེད་པའོ། མཚན་མ་གཅིག་པའམ།
en: Goddess, once they have attained one of those goals, they can easily be successful in all of them, while those who attempt to succeed in other goals without them will find their efforts fruitless.

source: དུར་ཁྲོད་དམ་ཆུ་འགྲམ་རྣམས་སུ་རྨ་མེད་པ་མ་གོད་པའི་རོའི་སྟེང་དུ་བསྡད་ནས་སྔགས་བརྒྱ་ཕྲག་བརྒྱད་བཟླས་ན་སྔགས་ཀྱི་རྗེས་ལ་ལྕེ་རེག་ཏུ་འོང་སྟེ།
en: “At a solitary liṅga, a cremation ground, or a riverbank, one should sit on top of an intact corpse that has not begun to decompose. After the mantra has been recited one hundred eight times, the corpse will stick out its tongue at the end of the mantra recitation, at which point one should cut it out and hold it in their right hand.

source: དེ་བཅད་ནས་ལག་པ་གཡས་པས་བཟུང་ན་རལ་གྲིའི་དངོས་གྲུབ་འགྲུབ་བོ། །
en: One will then attain the sword siddhi.

source: དེ་ནས་གཞན་ཡང་བརྗོད་པར་བྱ་སྟེ།
en: “I will explain some other procedures.

source: ཚྭ་བླངས་ལ་རོ་ལ་བསྣུན་ན་གསེར་དྲུག་ནམ་བརྒྱད་སྟེར་བར་བྱེད་དོ། །
en: “One should take some salt and hit the corpse with it. It will spit out six or eight pieces of gold.

source: ཚེས་བརྒྱད་དམ་བཅུའམ་བཅུ་བཞི་རྣམས་ལ་རང་གི་བཞི་མཉམ་བླངས་ནས་ལུས་ལ་བྱུགས་ཏེ་ཕྱི་ནས་བྲམ་ཟེའི་ཐོད་པའི་སྟེང་དུ་བསྡད་ནས།
en: “On the eighth, tenth, or fourteenth day of the lunar month, one should take their own catuḥsama and anoint their body with it.

source: སྨན་མུ་ཏ་ཀ་དང་ཤི་ཧླ་ཡིས་ལྷ་མོ་ལྔ་ལ་སོགས་པའི་མར་མེ་སྦར་ལ་རྡོ་རྗེའི་ཁང་པར་སྔགས་སྟོང་ཕྲག་གཅིག་བཟླས་པར་བྱ་སྟེ་དེ་ཡིས་བཟླས་པ་བྱ་བའི་སྔགས་ཀྱི་རྒྱལ་པོ་ནི་འདི་ཡིན་ཏེ།
en: They should then take a seat on a brahmin’s skull and light lamps to the five goddesses and so forth along with mutaka and olibanum and recite the mantra one thousand times within a vajra dwelling.

source: ཨོཾ་མ་ཧཱ་ཙཎྜ་ཧཱུྃ་ཧཱུྃ་ཧཱུྃ་ཕཊ་ཕཊ་ཕཊ་སྭཱ་ཧཱ་ཅེས་པའོ། །
en: The king of mantras that one should recite for this rite is oṁ mahācaṇḍa hūṁ hūṁ hūṁ phaṭ phaṭ phaṭ svāhā.

source: ནག་པོའི་ཕྱོགས་ཀྱི་ཚེས་བརྒྱད་ལ་ཆུ་འགྲམ་དུ་སོང་སྟེ།
en: “Then, on the eighth day of the waning moon, one should go to a riverbank and make a maṇḍala using butterfly-pea flowers.

source: མེ་ཏོག་ཨ་པ་རཱ་ཛི་ཏ་ཡིས་མཎྜལ་བྱས་ཏེ་ཆུ་འགྲམ་གྱི་བྱེ་མའི་སྟེང་དུ་གནོད་སྦྱིན་གྱི་ཀཱི་ལི་ཀཱི་ལའི་གཟུགས་བརྙན་ཡོངས་སུ་འདྲ་བ་བྱས་ལ་དྲི་སྣ་ཚོགས་ཀྱིས་ལུས་ལ་བྱུག་གོ། །
en: Then, on the sand at that riverbank one should make an image in the likeness of the yakṣa Kelīkīla and smear its body with various perfumes.

source: ཕྱི་ནས་དེ་རུ་བསྡད་ནས་སྔགས་བཟླས་པ་ནི། ཨོཾ་སུཿཥཿཧཱུྃ་ཞེས་པའི་སྔགས་སྟོང་ཕྲག་ལྔ་བཟླས་ན་ཁྱོད་བཟའི་ཞེས་སྨྲ་ཞིང་འོང་སྟེ།
en: Next, one should recite the mantra oṃ suḥ ṣaḥ hūṁ five thousand times while sitting in that maṇḍala.

source: སྒྲུབ་པ་པོས་ཀྱང་འཇིགས་པར་མི་བྱ་བར་གཡོག་པོ་ཁྱོད་ང་ཅག་གི་དོན་གྱིས་ཤིག་ཅེས་བརྗོད་ཅིང་དེའི་མགོ་ལ་ཨརྒྷ་ཕུལ་ན་གསེར་སྲང་ལྔ་བརྒྱ་ལྔ་བརྒྱ་ཉིན་རེ་ཞིང་སྟེར་བར་བྱེད་ཅིང་བཅུད་དང་བཅུད་ཀྱིས་ལེན་དང་ངོ་། །
en: The yakṣa will approach and say, ‘I am going to eat you,’ but the practitioner should not be afraid and should say to him, ‘Servant, you must do my bidding.’ When offering water is poured on his head he will give five hundred palas of gold every day, as well as the mercury siddhi and alchemy siddhi.

source: གལ་ཏེ་མ་བྱུང་ན་དེའི་ཚེ་མུ་ཟི་དང་། ལྷང་ཚེར་དང་། སུ་པརྞ་མ་ཀྵི་རྣམས་ལག་པ་གཡོན་པས་བཟུང་ལ། དེའི་སྤྱི་སྟེངས་སུ་ཐལ་ལྕག་གསུམ་རྒྱབ་ན་ངེས་པར་འོང་ངོ་། །
en: If this does not happen, one should take sulfur, mica, and suparṇamakṣī with the left hand and slap the top of his head three times, and he will surely come.

source: མ་འོངས་ན་མགོ་ཨརྫ་ཀའི་འབྲས་བུ་ལྟར་འགས་པར་འགྱུར་བས་རིམ་པ་དེ་ལྟར་བསྒྲུབ་པ་བྱས་ན་གང་འདོད་པ་དེ་བྱེད་དེ།
en: If he does not come, his head will burst open like the flowering top of a wild basil plant. If the practice was performed following the proper procedure, he will do whatever one wants.

source: དེ་ལྟར་བྱས་ན་གནོད་སྦྱིན་བརྒྱད་ཀ་ཡང་འོང་བར་འགྱུར་རོ། །
en: The eight yakṣas will also come if one performs that practice.

source: རྣལ་འབྱོར་པས་གྲོང་ཁྱེར་གྱི་མཐར་སོང་ལ་ནག་པོ་ཆེན་པོ་ཕྱག་བཞི་པའི་སྔགས་སྟོང་ཕྲག་ལྔ་སོང་བ་དང་།
en: “The yogin should go to edge of a city and recite the mantra for the four-armed Mahākāla five thousand times.

source: ཕྱི་ནས་ནག་པོ་ཆེན་པོའི་དཀྱིལ་འཁོར་བཞེངས་ལ་ཤ་ཎའི་རྩ་བ་དང་། སྨན་ཛ་ཏ་ཀའི་པགས་པ་དང་། སྨན་ཏི་མི་རིའི་རྩ་བ་རྣམས་བཏགས་པས་ལུས་ལ་བྱུགས་ན།
en: After that he should set up Mahākāla’s maṇḍala, grind rattleweed root, jataka bark, and timira root, and rub it on the body.

source: འཇིགས་བྱེད་ཆེན་པོ་སྒྲ་ཆེན་པོ་དང་བཅས་ནས་འོངས་པས་ཙནྡན་གྱི་ཆུ་དང་ནམ་མཁའི་ཆུ་ཡིས་ཨརྒྷ་དབུལ་ཏེ།
en: After Mahābhairava arrives with a great roar, he should present offering water that has been infused with sandalwood and rainwater.

source: དེ་མཐོང་བ་ལ་འཇིགས་པར་མི་བྱའོ། །
en: The yogin should not be afraid when he sees him.

source: སྒྲུབ་པའི་གྲོགས་པོ་བྱང་ཕྱོགས་ན་གནས་པས་སྐྱེས་བུ་ཞེས་པ་དང་བཅས་པས་ཕྱོགས་གསུམ་དུ་བསྒོ་བ་བྱས་ན་གང་འདོད་པ་དེ་ཡིས་བྱེད་དོ། །
en: This practitioner’s assistant should be seated in the north and addressed as ‘son.’ Once the yogin issues a command three times, he will do whatever the yogin wants.

source: གཞན་ཡང་སྐྱེད་མོས་ཚལ་དུ་སོང་ནས་ཤིང་མྱ་ངན་མེད་པའི་འོག་ཏུ་སྟག་གི་པགས་པའི་སྟེང་དུ་བསྡད་ལ་གཅེར་བུར་ཕུད་སྐྲ་བཀྲོལ་བ།
en: “Alternatively, one should go to a park and take a seat on a tiger skin under an aśoka tree, naked and with their topknot undone.

source: བདག་སྲུང་བ་ཡན་ཆོད་དེ་ལྟར་བྱས་ནས་ཤིང་པུ་པ་སིམ་པའི་ལོ་མའི་ཁུ་བས་ལུས་ལ་བྱུགས་ནས་ནག་པོ་ཆེན་པོ་ཕྱག་གཉིས་པའི་སྔགས་སྟོང་ཕྲག་གཅིག་བཟླས་པ་དང་།
en: One should perform everything up to the self-protection rite as before and rub their body with a juice from the leaves of a sūpāśimbī tree.

source: གཏོར་མ་སྦྱིན་པ་ནི་མར་དང་། སྦྲང་རྩི་དང་།
en: They should then recite the mantra of the two-armed Mahākāla one thousand times and perform a bali offering that is well supplied with ghee, honey, cooked grains, black gram, beleric myrobalan fruits, alcohol, and meat.

source: སུལ་ཀ་དང་། སྲན་མ་དང་། ཏུ་མུ་ལ་དང་། ཆང་དང་། ཤ་རྣམས་ཀྱིས་ཡང་དག་པར་བརྒྱན་ལ་ཕྱི་ནས་རལ་གྲི་ཐོགས་ནས་སྤྱོན་ཞེས་པ་ཕོགས་གསུམ་བརྗོད་པ་དང་།
en: After that, they should brandish a sword and utter ‘approach’ three times.
